package oop;

public class Ex01 {
	/*
	 * OOP : Objective Oriented Programming
	 *  - 객체 지향 프로그래밍
	 *  - 객체(= 데이터)를 저장하고 객체 간의 상호협력 관계를 구축해서 프로그램을 작성하는 기법
	 *  
	 *  객체(Object) : 현실의 모든 데이터를 의미
	 *  클래스(Class) : 객체를 코드로 표현해 놓은 상태(= 도면)
	 *  인스턴스(Instance) : 클래스를 실제 컴퓨터 메모리에 생성한 상태(= 실체)
	 *  
	 *  
	 *  작성 순서)
	 *  객체를 지정 -> 클래스로 표현 -> 메모리에 올려 인스턴스를 생성
	 *  
	 *  
	 *  class 클래스명 {
	 *  	1. 필드 : 멤버 변수
	 *  	- 객체의 속성을 작성한다 (ex. 이름, 나이, 키 등)
	 *  
	 *  	2. 메서드 : 멤버 함수
	 *  	- 객체의 기능을 작성한다 (ex. 사람이 공부한다, 사람이 밥을 먹는다 등)
	 *  }
	 *  
	 */
}
